{
	"接口中文名称": "添加管理员",
	"请求参数": [
		{
			"参数名": "username",
			"必选": "是",
			"类型": "string",
			"参数中文名": "用户名",
			"最大长度": 16,
			"测试值": "admin_"
		},
		{
			"参数名": "password",
			"必选": "是",
			"类型": "string",
			"参数中文名": "密码",
			"最大长度": 16,
			"测试值": "admin_"
		},
		{
			"参数名": "nick_name",
			"必选": "是",
			"类型": "string",
			"参数中文名": "用户昵称",
			"最大长度": 16,
			"测试值": "系统管理员_"
		},
		{
			"参数名": "data.email",
			"类型": "string",
			"参数中文名": "电子邮箱"
		},
		{
			"参数名": "data.group_id",
			"必选": "是",
			"类型": "int",
			"参数中文名": "管理员组id"
		},
		{
			"参数名": "status",
			"必选": "是",
			"类型": "int",
			"参数中文名": "状态id",
			"最大长度": 65536,
			"测试值": "1"
		}
	],
	"返回参数": [
		{
			"参数名": "id",
			"必选": "是",
			"类型": "int",
			"参数中文名": "管理员id"
		}
	]
}