{
	"接口中文名称": "修改管理员",
	"请求参数": [
		{
			"参数名": "id",
			"必选": "是",
			"类型": "int",
			"中文参数名": "管理员id"
		},{
			"参数名": "username",
			"必选": "是",
			"类型": "string",
			"中文参数名": "用户名"
		},{
			"参数名": "password",
			"必选": "是",
			"类型": "string",
			"中文参数名": "密码"
		},{
			"参数名": "nick_name",
			"必选": "是",
			"类型": "string",
			"中文参数名": "用户昵称"
		},{
			"参数名": "job_id",
			"必选": "是",
			"类型": "int",
			"中文参数名": "角色id"
		}, {
			"参数名": "status",
			"必选": "是",
			"类型": "int",
			"中文参数名": "状态id"
		}
	],
	"返回参数": []
}