{
	"接口中文名称": "管理员列表",
	"请求参数": [
		{
			"参数名": "job_id",
			"必选": "否",
			"类型": "int",
			"说明": "角色id"
		}, {
			"参数名": "status",
			"必选": "否",
			"类型": "int",
			"说明": "状态id"
		}, {
			"参数名": "keywowrd",
			"必选": "否",
			"类型": "string",
			"说明": "搜索关键字"
		}, {
			"参数名": "page",
			"必选": "否",
			"类型": "int",
			"说明": "页数"
		}, {
			"参数名": "page_size",
			"必选": "否",
			"类型": "int",
			"说明": "每页记录数"
		}
	],
	"返回参数": [{
			"参数名": "id",
			"必选": "是",
			"类型": "int",
			"说明": "管理员id"
		},{
			"参数名": "total",
			"必选": "是",
			"类型": "int",
			"说明": "记录总数"
		},{
			"参数名": "list",
			"必选": "是|可空",
			"类型": "array",
			"说明": "记录集"
		},{
			"参数名": "list.username",
			"必选": "是",
			"类型": "string",
			"说明": "用户名"
		},{
			"参数名": "list.nick_name",
			"必选": "是",
			"类型": "string",
			"说明": "用户昵称"
		},{
			"参数名": "list.job_id",
			"必选": "是",
			"类型": "int",
			"说明": "角色id"
		}, {
			"参数名": "list.status",
			"必选": "是",
			"类型": "int",
			"说明": "状态id"
		}, {
			"参数名": "list.add_time",
			"必选": "是",
			"类型": "datetime",
			"说明": "添加时间"
		},{
			"参数名": "list.last_time",
			"必选": "是|可空",
			"类型": "datetime",
			"说明": "最后登录时间"
		},{
			"参数名": "list.ip",
			"必选": "是|可空",
			"类型": "string",
			"说明": "最后登录ip"
		}
	]
}