{
	"接口中文名称": "获取系统字典",
	"请求参数": [
		{
			"参数名": "type",
			"必选": "是",
			"类型": "string",
			"参数中文名": "字典数据类型",
			"说明": "多个以英文逗号隔开。 area=地区 grade=年级 ",
			"测试值":"area",
			"暂定": "student_status=学生状态 parent_status=家长状态 teacher_status=导师状态 admin_status=管理员状态……"
		}
	],
	"返回参数": [
		{
			"参数名": "list",
			"必选": "是",
			"类型": "array",
			"参数中文名": "字典数据记录集"
		},
		{
			"参数名": "list.id",
			"必选": "是",
			"类型": "int",
			"参数中文名": "数据id"
		},
		{
			"参数名": "list.name",
			"必选": "是",
			"类型": "string",
			"参数中文名": "数据名称"
		},
		{
			"参数名": "list.type",
			"必选": "是",
			"类型": "string",
			"参数中文名": "字典数据类型"
		}
	]
}