{
	"接口中文名称": "修改家长",
	"请求参数": [
		{
			"参数名": "id",
			"必选": "是",
			"类型": "int",
			"中文参数名": "家长id"
		},{
			"参数名": "username",
			"必选": "是",
			"类型": "string",
			"中文参数名": "用户名",
			"说明": "16位以内"
		},{
			"参数名": "cn_name",
			"必选": "是",
			"类型": "string",
			"中文参数名": "中文姓名",
			"说明": "16位以内"
		},{
			"参数名": "nick_name",
			"必选": "是",
			"类型": "string",
			"中文参数名": "昵称或英文名",
			"说明": "32位以内"
		},{
			"参数名": "gender",
			"必选": "是",
			"类型": "int",
			"中文参数名": "性別"
		},{
			"参数名": "phone",
			"必选": "是",
			"类型": "string",
			"中文参数名": "手机号码",
			"说明": "16位以内"
		},{
			"参数名": "tel",
			"必选": "是",
			"类型": "string",
			"中文参数名": "住宅电话",
			"说明": "16位以内"
		},{
			"参数名": "address",
			"必选": "是",
			"类型": "string",
			"中文参数名": "详细地址",
			"说明": "50位以内"
		},{
			"参数名": "status",
			"必选": "是",
			"类型": "int",
			"中文参数名": "状态id"
		}
	],
	"返回参数": []
}