{
	"接口中文名称": "导师列表",
	"请求参数": [
		{
			"参数名": "status",
			"必选": "否",
			"类型": "int",
			"中文参数名": "状态id"
		}, {
			"参数名": "keywowrd",
			"必选": "否",
			"类型": "string",
			"中文参数名": "搜索关键字"
		}, {
			"参数名": "page",
			"必选": "否",
			"类型": "int",
			"中文参数名": "页数"
		}, {
			"参数名": "page_size",
			"必选": "否",
			"类型": "int",
			"中文参数名": "每页记录数"
		}
	],
	"返回参数": [
		{
			"参数名": "total",
			"必选": "是",
			"类型": "int",
			"中文参数名": "记录总数"
		},
		{
			"参数名": "list",
			"必选": "是|可空",
			"类型": "array",
			"中文参数名": "记录集"
		},
		{
			"参数名": "id",
			"必选": "是",
			"类型": "int",
			"中文参数名": "导师id"
		},
		{
			"参数名": "list.cn_name",
			"必选": "是",
			"类型": "string",
			"中文参数名": "身份证中文名 16位以内"
		},
		{
			"参数名": "list.en_name",
			"必选": "是",
			"类型": "string",
			"中文参数名": "身份证英文名 32位以内"
		},
		{
			"参数名": "list.gender",
			"必选": "是",
			"类型": "int",
			"中文参数名": "性別"
		},
		{
			"参数名": "list.birth_year", 
			"必选": "是",
			"类型": "int",
			"中文参数名": "出生年份"
		},
		{
			"参数名": "list.area",
			"必选": "是",
			"类型": "int",
			"中文参数名": "居住地区 香港有19个区"
		},
		{
			"参数名": "list.address",
			"必选": "是",
			"类型": "string",
			"中文参数名": "居住地址 50位以内"
		},
		{
			"参数名": "list.dormitory",
			"必选": "是",
			"类型": "string",
			"中文参数名": "现住大学宿舍 1=是 0=否"
		},
		{
			"参数名": "list.phone",
			"必选": "是",
			"类型": "string",
			"中文参数名": "手机号码 16位以内"
		},
		{
			"参数名": "list.tel",
			"必选": "是",
			"类型": "string",
			"中文参数名": "住宅电话 16位以内"
		},
		{
			"参数名": "list.email",
			"必选": "是",
			"类型": "string",
			"中文参数名": "电子邮件地址 50位以内"
		},
		{
			"参数名": "list.link_name",
			"必选": "是",
			"类型": "string",
			"中文参数名": "紧急联系人姓名 16位以内"
		},
		{
			"参数名": "list.link_tel",
			"必选": "是",
			"类型": "string",
			"中文参数名": "紧急联系人电话 16位以内"
		},
		{
			"参数名": "list.relationship",
			"必选": "是",
			"类型": "int",
			"中文参数名": "与紧急联系人的关系"
		},
		{
			"参数名": "list.relationship_rem",
			"必选": "是",
			"类型": "string",
			"中文参数名": "与紧急联系人的关系备注"
		},
		{
			"参数名": "list.relationship_rem",
			"必选": "是",
			"类型": "string",
			"中文参数名": "与家长关系备注"
		},
		{
			"参数名": "list.crime_sex",
			"必选": "是",
			"类型": "string",
			"中文参数名": "性罪行记录 1=有 0=无"
		},
		{
			"参数名": "list.crime_sex_rem",
			"必选": "是",
			"类型": "string",
			"中文参数名": "性罪行记录备注"
		},
		{
			"参数名": "list.crime",
			"必选": "是",
			"类型": "string",
			"中文参数名": "刑事罪行记录 1=有 0=无"
		},
		{
			"参数名": "list.crime_rem",
			"必选": "是",
			"类型": "string",
			"中文参数名": "刑事罪行记录备注"
		},
		{
			"参数名": "list.status",
			"必选": "是",
			"类型": "int",
			"中文参数名": "状态id"
		},
		{
			"参数名": "list.add_time",
			"必选": "是",
			"类型": "datetime",
			"中文参数名": "添加时间"
		}
	]
}