{
	"接口中文名称": "标签列表",
	"生成sql" : true,
	"请求参数": [
		{
			"参数名": "keywowrd",
			"必选": "否",
			"类型": "string",
			"参数中文名": "搜索关键字"
		},
		{
			"参数名": "page",
			"必选": "否",
			"类型": "int",
			"参数中文名": "页码"
		},
		{
			"参数名": "page_size",
			"必选": "否",
			"类型": "int",
			"参数中文名": "每页记录数"
		}
	],
	"返回参数": [
		{
			"参数名": "total",
			"必选": "是",
			"类型": "int",
			"参数中文名": "记录总数"
		},
		{
			"参数名": "per_page",
			"必选": "是",
			"类型": "int",
			"参数中文名": "总页数"
		},
		{
			"参数名": "current_page",
			"必选": "是",
			"类型": "int",
			"参数中文名": "当页码"
		},
		{
			"参数名": "last_page",
			"必选": "是",
			"类型": "int",
			"参数中文名": "未页页码"
		},
		{
			"参数名": "total",
			"必选": "是",
			"类型": "int",
			"参数中文名": "记录总数"
		},
		{
			"参数名": "data",
			"必选": "是|可空",
			"类型": "array",
			"参数中文名": "记录集"
		},
		{
			"参数名": "data.id",
			"必选": "是",
			"类型": "int",
			"参数中文名": "标签id"
		},
		{
			"参数名": "data.name",
			"必选": "是",
			"类型": "string",
			"参数中文名": "标签"
		},
		{
			"参数名": "data.add_time",
			"必选": "是",
			"类型": "datetime",
			"参数中文名": "添加时间"
		},
		{
			"参数名": "data.up_time",
			"必选": "是",
			"类型": "datetime",
			"参数中文名": "最后修改时间"
		}
	]
}