{
	"接口中文名称": "修改学生",
	"请求参数": [
		{
			"参数名": "id",
			"必选": "是",
			"类型": "int",
			"中文参数名": "家长id"
		},{
			"参数名": "cn_name",
			"必选": "是",
			"类型": "string",
			"中文参数名": "中文姓名",
			"说明": "16位以内"
		},{
			"参数名": "nick_name",
			"必选": "是",
			"类型": "string",
			"中文参数名": "昵称或英文名",
			"说明": "32位以内"
		},{
			"参数名": "gender",
			"必选": "是",
			"类型": "int",
			"中文参数名": "性別"
		},{
			"参数名": "birth_year", 
			"必选": "是",
			"类型": "int",
			"中文参数名": "出生年份"
		},{
			"参数名": "phone",
			"必选": "是",
			"类型": "string",
			"中文参数名": "手机号码",
			"说明": "16位以内"
		},{
			"参数名": "address",
			"必选": "是",
			"类型": "string",
			"中文参数名": "详细地址",
			"说明": "50位以内"
		},{
			"参数名": "school",
			"必选": "是",
			"类型": "string",
			"中文参数名": "现就读学校",
			"说明": "50位以内"
		},{
			"参数名": "grade",
			"必选": "是",
			"类型": "int",
			"中文参数名": "年级"
		},{
			"参数名": "grade_rem",
			"必选": "是",
			"类型": "string",
			"中文参数名": "其它年级备注"
		},{
			"参数名": "relationship",
			"必选": "是",
			"类型": "int",
			"中文参数名": "与家长关系"
		},{
			"参数名": "relationship_rem",
			"必选": "是",
			"类型": "string",
			"中文参数名": "与家长关系备注"
		},{
			"参数名": "status",
			"必选": "是",
			"类型": "int",
			"中文参数名": "状态id"
		}
	],
	"返回参数": []
}